## Nano Degree Club Assignment 1
### Author: Muhammad Bilal
### Submitted to: Sir Umair Baig

In [1]:
# Loading libraries
import numpy as np
import pandas as pd

# Loading data into dataframe from csv
sma_data = pd.read_csv("/content/Standard_Metropolitan_Areas_Data.csv")

1. sma_data is a pandas dataframe. What is the shape of the dataframe 'sma_data'?

In [2]:
sma_data.shape
# Since the Shape is (99,10) we conclude that data set contains 99 rows and 10 columns

(99, 10)

2. How many entries are there in the dataframe sma_data?

In [3]:
len(sma_data)

99

3. Which method will help you display the last five observations from the dataframe?

In [4]:
sma_data.head()

   land_area  percent_city  percent_senior  ...  income  region  crime_rate
0       1384          78.1            12.3  ...   72100       1       75.55
1       3719          43.9             9.4  ...   54542       2       56.03
2       3553          37.4            10.7  ...   33216       1       41.32
3       3916          29.9             8.8  ...   32906       2       67.38
4       2480          31.5            10.5  ...   26573       4       80.19

[5 rows x 10 columns]

4. Select the correct statement about the data types of different columns.

> 1.   The Data Type of land_area is an integer
> 2.   There are 5 columns whos datatype is float
> 3.   There are 5 columns whos datatype is integer
> 4.   All of the above **( Correct Option )**
> 5.   None of the above

In [6]:
sma_data.dtypes

land_area           int64
percent_city      float64
percent_senior    float64
physicians          int64
hospital_beds       int64
graduates         float64
work_force        float64
income              int64
region              int64
crime_rate        float64
dtype: object

5. Use the index-based selection technique to select the 10th observation from data frame sma_data. What is the crime_rate for this observation? 
[Remember indexing in Python starts with 0, so if you have to select nth observation you should get the observation present at index n-1]

In [15]:
print(f'crime rate for 10th observation is : { sma_data["crime_rate"][9] }')

crime rate for 10th observation is : 55.3

6. Select the physicians column. Get the last value from the physicians column.

In [16]:
sma_data['physicians'].tail(n=1)

98    140
Name: physicians, dtype: int64

7. Select the records with index labels (numerical positions) - 1, 3, 5, 7, 9 and 13 and columns - 'land_area', 'work_force', 'income', 'region' and 'crime_rate'. Assign the result to a variable sample_data1. Select the correct statement about this sample_data1. [Hint: Use label-based selection technique]

> 1. Crime Rates are less than 70 for all the observations in the dataframe sample_data1
> 2. The Observation indexed at 13 has an income of 12591
> 3. All of the above **( Correct Option )**
> 4. None of the above

In [20]:
sample_data1 = sma_data[['land_area', 'work_force', 'income', 'region', 'crime_rate']][1:14:2]
sample_data1.drop(axis=1,index=11,inplace=True)
sample_data1

    land_area  work_force  income  region  crime_rate
1        3719      3305.9   54542       2       56.03
3        3916      1966.7   32906       2       67.38
5        2815      1541.9   25663       3       58.48
7        6794      1272.7   18221       3       64.88
9        4647      1032.2   14542       2       55.30
13        782       915.2   12591       4       63.20

8. Select the observations for which the region is equal to 2. Assign the result to a variable sample_data2. How many observations are there in the dataframe sample_data2? [Hint: sma_data.region is equal to?]

In [27]:
sample_data2 = sma_data[sma_data['region'] == 2]
sample_data2.shape
# Therefore we conclude that there are 25 observations in the dataframe sample_data2

(25, 10)